Revit 2027 API
ImageBackgroundSettings.OffsetWidth Property
 The horizontal offset of the rendering image to the rendering region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OffsetWidth { get; set; }
Public Property OffsetWidth As Double
	Get
	Set
public:
property double OffsetWidth {
	double get ();
	void set (double value);
}
member OffsetWidth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for width must be no more than 30000 feet in absolute value.
See Also
Reference
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace